#include <stdio.h>
int main()
{
    /********************整数********************
     * 基本整型：int【10位整数，-2147483648 ~ 2147483648（-2^31 ~ 2^31），4字节】                     * 无符号基本整型【（0 ~ 2^32 - 1），4字节】
     * 短整型：short int【5位整数，-32768 ~ 32768（-2^15 ~ 2^15），2字节】（数字后加l或L）
     * 长整型：long int【10位整数，-2147483648 ~ 2147483648（-2^31 ~ 2^31），4字节】（数字后加l或L）

     * 十进制：一般数字写法
     * 八进制：数字前加0
     * 十六进制：数字前加x（或者X、0x、0X）
    ********************************************/
    int i = 88;  //初始化整型变量i为十进制数88；
    int j = 0130;   //初始化整型变量j为八进制数130；
    unsigned int ui = - 9;   //无符号基本整型
    int iu = - 9U;
    short int s = 12345;  //短整型
    long int l = 123456789;  //长整型

    printf("基本整型 i = %d（十进制） = %o（八进制） = %x（十六进制）,\n八进制整型 j = %o = %d = %0x\n", i, i, i, j, j, j);
    printf("ui = %d, iu = %d\n", ui, iu);
    printf("s = %d, l = %ld\n", s, l);


    /********************实数********************
     * 单精度浮点型:：float【保证6位有效数字（3.4 x 10^-38 ~ 3.4 x 10^38），4字节】（数字后加f或F）
     * 双精度浮点型：double【保证15位有效数字（1.7 x 10^-308 ~ 1.7 x 10^308），8字节】
    ********************************************/
    float f = 2.123456;    //初始化单精度浮点型变量f
    double d = 2.123456789;    //初始化双精度浮点型变量d
    float x = 3.14159e5;  //科学计数法表示浮点数

    printf("f = %.6f\nd = %.10f\n", f, d);   //输出f和d小数点后9位的值
    printf("x = %f\n", x);


    /********************字符********************
     * ASCII码（ASCII字符集）规定了字符和整数值的对应关系，它规定具体某字符用哪个整数值表示
     * 【1字节】
    ********************************************/

    char ch = 'A'; //字符型
    //单个字符型数据要用单引号括起来
    int zs = 66;

    printf("%c, %d\n", ch, ch);   //分别以字符格式和整数格式输出变量ch的值
    printf("%d, %c\n", zs, zs);   //分别以整数格式和字符格式输出变量zs的值

    return 0;
}

/********************************
 * 格式控制符
    %d                                          十进制整型格式
    %ld                                         十进制长整型格式
    %o                                          八进制整型格式
    %x, %0x, %0X, %#x, %#X       十六进制整型格式
    %f                                           浮点型格式
    %.9f                                        保留小数点后9位浮点型格式
    %c                                          字符型格式
    %s                                          字符串

 * 存储空间大小
    位：bit
    字节：Byte
    1Byte = 2^3bit = 8bit

    1K = 2^10Byte = 1024Byte
    1M = 2^10K = 1024K
    1G = 2^10M = 1024M
    1T = 2^10G = 1024G
********************************/
